Repository: CoffeeStraw/UnistudiumListenerBot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: it_it

# start_msg
source: *Welcome to* @UnistudiumListenerBot. This bot will keep you updated in real time about the new uploads of the professors in the Unistudium platform. _This bot has to be considered unofficial, neither KITLab or Unipg are responsible in any way._
it_it: *Benvenuto a* @UnistudiumListenerBot. Questo bot ti terrà aggiornato in tempo reale sui nuovi caricamenti effettuati dai docenti nei rispettivi corsi presenti sulla piattaforma Unistudium. _Il bot è da considerarsi non ufficiale, né KITLab né Unipg sono responsabili in alcun modo._

# help_msg
source: Here it is a list of the available *commands* that the bot can run: - /info: Useful informations about the bot and its creator - /trylogin: Attempt a login to the Unistudium portal with the credentials provided in the file _cred.json_ - /listen: Allows to add to your personal list the courses you want the bot to listen for you - /stoplisten: Permette di rimuovere dalla propria lista personale i corsi di cui non si vuole più ricevere aggiornamenti - /viewfiles: Permette di visualizzare una lista di tutti i files presenti in un determinato corso - /settings: Accedi alla sezione dedicata alle impostazioni per modificare alcuni parametri relativi all'esperienza utente
it_it: Questa è una lista degli attuali *comandi* presenti nel bot: - /info: Informazioni utili sul bot e sul suo creatore - /trylogin: Effettua un tentativo di connessione al portale di Unistudium con le credenziali fornite all'interno del file _cred.json_ - /listen: Permette di aggiungere alla propria lista personale i corsi che si desiderano far ascoltare al bot - /stoplisten: Permette di rimuovere dalla propria lista personale i corsi di cui non si vuole più ricevere aggiornamenti - /viewfiles: Permette di visualizzare una lista di tutti i files presenti in un determinato corso - /settings: Accedi alla sezione dedicata alle impostazioni per modificare alcuni parametri relativi all'esperienza utente

# info_msg
source: *UnistudiumListener* is the best way to keep you updated on the latest uploads on you courses in *Unistudium* web site. The full open code is available on the GitHub web page of the creator. If you like this bot, you could offer a beer to the programmer!
it_it: *UnistudiumListener* è il miglior metodo per tenerti sempre aggiornato sugli ultimi argomenti caricati dai docenti su *Unistudium*. L'intero codice sorgente è totalmente open ed è consultabile sulla pagina GitHub del creatore di questo bot. Se questo bot ti piace, offrimi una birra!

# add_to_group_msg
source: Hello, I'm *UnistudiumListener*, and from now on I will keep you updated on the latest uploades made by Teachers on the Unistudium portal. _For more informations, you can use the command_ /info@UnistudiumListenerBot
it_it: Ciao, sono *UnistudiumListener*, un bot che vi terrà sempre aggiornati sugli ultimi caricamenti effettuati dai docenti sul portale di Unistudium. _Per ulteriori informazioni usate il comando_ /info@UnistudiumListenerBot

# connected_msg
source: I managed to connect, welcome *{}*!
it_it: Sono riuscito a collegarmi, benvenuto *{}*!

# already_connected_msg
source: You're already connected to the Unistudium website
it_it: Sei già connesso al portale

# err_login_msg
source: You forgot to enter your username and/or your password in the _cred.json_ file. Please modify them and try again
it_it: Non hai inserito il tuo username e/o la tua password nel file _cred.json_. Modificali e riprova.

# choose_course_add_msg
source: Select the course that you want me to hear for you
it_it: Seleziona il corso che vuoi che ascolti per te

# notification_course_on_msg
source: 🔔 From now on you will receive notifications about: *{}*
it_it: 🔔 Da ora in poi riceverai le notifiche di: *{}*

# err_already_following_msg
source: You're already following the chosen course. Don't forget that you can stop following it using /stoplisten
it_it: Stai già seguendo il corso scelto. Puoi smettere di seguirlo con il comando /stoplisten

# err_course_not_found
source: The chosen course isn't valid, please choose one from the keyboard
it_it: Il corso scelto non è valido, scegline uno dalla tastiera

# err_not_following_any_course_msg
source: Currently you're not following any course. You can start following one using /listen
it_it: Attualmente non stai seguendo nessun corso. Puoi cominciare a seguirne uno col comando /listen

# choose_course_rem_msg
source: Select the course you want me to stop listen for you
it_it: Seleziona il corso che vuoi che smetta di ascoltare

# notification_course_off_msg
source: 🔕 From now on you will no longer receive notifications about: *{}*
it_it: 🔕 Da ora in poi non riceverai più notifiche da: *{}*

# err_viewfiles_msg
source: Currently you're not following any course, so I can't show you any files. You can start to follow one using /listen
it_it: Attualmente non stai seguendo nessun corso per cui io possa mostrarti i files. Puoi cominciare a seguirne uno col comando /listen

# choose_course_view_msg
source: Select the course of which you want to view uploaded files
it_it: Seleziona il corso di cui vuoi vedere i files caricati

# course_filelist_head_msg
source: Here there are all the files I found in the course of *{}*:
it_it: Ecco tutti i file che ho trovato nel corso di *{}*:

# settings_initial_msg
source: ⚙️ You can modify one of the settings below, changing them according to your preferences
it_it: ⚙️ Accedi ad una delle impostazioni di seguito riportate, modificandole in base alle tue preferenze

# choose_lang_msg
source: Select your preferred *language*
it_it: Seleziona la tua *lingua*

# choose_noti_msg
source: Turn *ON/OFF*. _I would like to remember you that you will receive notifications of only the courses added with command_ /listen
it_it: Seleziona *abilita/disabilita*. _Ricordati che riceverai notifiche solo dei corsi che hai aggiunto tramite il comando_ /listen

# choose_dl_msg
source: Select your *preference*
it_it: Seleziona la tua *preferenza*

# err_settings_msg
source: The specified setting isn't valid, please choose one from keyboard
it_it: L'impostazione specificata non è valida, scegline una dalla tastiera

# lang_set_msg
source: The specified language has been set
it_it: La lingua specificata è stata impostata

# noti_set_msg
source: The notification setting has been updated
it_it: L'impostazione riguardante le notifiche è stata aggiornata

# dl_set_msg
source: The download setting has been updated
it_it: L'impostazione riguardante i download è stata aggiornata

# err_settings_set_msg
source: The specified setting isn't valid, please choose one from keyboard
it_it: La preferenza specificata non è valida, scegline una dalla tastiera

# cmd_input_err_msg
source: Unrecognized command. Try /help to see a list of all available commands
it_it: Il comando inserito non è valido Prova ad usare /help per una lista dei comandi disponibili

# new_upd_msg
source: Hi, there are new updated in the course of *{}*:
it_it: Ciao, ho trovato dei nuovi aggiornamenti nel corso di *{}*:

# new_upd_add_msg
source: 📎 *Files added:*
it_it: 📎 *Files aggiunti:*

# new_upd_rem_msg
source: 💣 *Files removed:*
it_it: 💣 *Files rimossi:*

# err_server_unavailable_msg
source: It seems that I can't contact the server, please try again later...
it_it: Non riesco a contattare il server, riprova più tardi...

# set_opt_1
source: Language
it_it: Lingua

# set_opt_2
source: Notification
it_it: Notifiche

# set_opt_3
source: Automatic download
it_it: Download automatico

# set_disable
source: Disable
it_it: Disabilita

# set_enable
source: Enable
it_it: Abilita

# set_enable1
source: Enable for all the files
it_it: Abilita per tutti i files

# set_enable2
source: Enable only for the latest files uploaded
it_it: Abilita solo per gli ultimi files caricati

# donate_inline
source: Donate
it_it: Dona

# donate_msg
source: Function to be implemented, for now you can offer it in person!
it_it: Funzione non ancora implementata, offrigliela di persona!
